<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Importera möbler</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Hjälpen för Sweet Home 3D</a> > <a class="bread" href="tocImporting.html">Importera bakgrundsbild och möbler</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Importera möbler</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>För att importera en existerande 3D-modell till möbelkatalogen och/eller 
          hemmets planlösning, välj <i>Möbler &gt; Importera möbler...</i> eller 
          dra och släpp filen innehållande 3D-modellen i ett Sweet Home 3D-fönster.<br>
          Dessa operationer föreställer en guide som hjälper dig, om nödvändigt, 
          välja filen för en 3D-modell och definiera dess egenskaper i några steg.</p>
        <table border="0" align="center" cellpadding="0" cellspacing="5">
          <tr>
            <td><img src="../images/importingFurnitureStep1.png" alt="Step 1" width="250" height="199"></td>
            <td><img src="../images/importingFurnitureStep2.png" alt="Step 2" width="250" height="200"></td>
          </tr>
          <tr>
            <td><img src="../images/importingFurnitureStep3.png" alt="Step 3" width="250" height="200"></td>
            <td><img src="../images/importingFurnitureStep4.png" alt="Step 4" width="250" height="200"></td>
          </tr>
        </table>        
    </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td nowrap><p>1.</p>
            </td>
            <td><p>Klicka på <i>Välj modell</i> och välj en fil i OBJ-, DAE-, 3DS, LWS-format eller en ZIP-fil innehållande en fil av denna typ. När modellen väl är laddad, klicka på <i>Fortsätt</i>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>2.</p>
            </td>
            <td><p>Vänd modellen med pil-knapparna på ett sådant sätt att vyn framifrån visar framsidan av 3D-modellen.
                Ibland renderas somliga 3D-modeller felaktigt eftersom deras bak- och framsida är inverterade. Om så är fallet kryssar du i <i>Invertera bak- och framsida</i>-kryssrutan.<br>
                Klicka sedan på <i>Fortsätt</i>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>3.</p>
            </td>
            <td><p>Om nödvändigt ändrar du namnet, storleken, upphöjningen och färgen på den importerade modellen, samt huruvida denna modell är rörlig och om det är en dörr eller ett fönster.<br>
                När en 3D-modell importeras till hemmets möbellista eller planlösning, kryssa i rutan <i>Lägg till i katalogen</i> om du också vill lägga till möbeln i möbelkatalogen. <br>
                  Ta bort markeringen i rutan <i>Behåll proportioner</i> om du vill ändra bredd, djup eller höjden oberoende av de andra på en 3D-modell.<br>
  Klicka på <i>Ta bort färg</i>-knappen om du föredrar att behålla modellens standardfärger efter att du ändrat färgen på den.<br>
                  Klicka sedan på <i>Fortsätt</i>.            </p>
              </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>4.</p>
            </td>
            <td><p>Vrid 3D-modellen med hjälp av musen för att få bästa möjliga synvinkel på modellen för modellens ikon som visas i möbelkatalogen, möbellistan och i planlösningen. Klicka sedan på <i>Slutför</i>.</p>
            </td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>När möbelimporteraren väl är stängd kommer den importerade modellen dyka upp i möbelkatalogen och/eller i planlösningen och möbellistan beroende på de val du gjorde.<br>
        Du kan <a href="editingFurniture.html">ändra</a> den i planlösningen precis som möblerna från standardkatalogen.<br>
        Namnet på möbler som importerats till katalogen visas i kursiv stil i katalogen. För att ändra egenskaperna på en importerad model med möbelimporteraren dubbelklickar du på den, eller markera den och väljer <i>Möbler &gt; Ändra...</i>.<br>
        </p>
      </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16">
              <p>&#149;</p>
            </td>
            <td>
              <p>Att importera 3D-modeller genom att dra och släppa deras fil i ett Sweet Home 3D-fönster kanske inte fungerar på Linux.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Om du behöver rotera en 3D-modell i steg om 1° istället för 90° håller du Shift-tangenten nedtryckt medan du klickar på pilknapparna från andra steget.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Textf&auml;ltet i <i>Kategori</i>-listrutan g&aring;r att &auml;ndra om du skulle beh&ouml;va skapa en ny kategori av m&ouml;bler.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>N&auml;r magnetism &auml;r aktiverat kan bara d&ouml;rrar eller f&ouml;nster placeras p&aring; en v&auml;gg med musen, och endast denna typ av m&ouml;bler kan g&ouml;ra ett h&aring;l i v&auml;ggen. D&auml;rf&ouml;r f&aring;r du inte gl&ouml;mma att v&auml;lja <i>D&ouml;rr eller f&ouml;nster</i>-kryssrutan om du vill att en importerad m&ouml;bel ska bete sig p&aring; detta vis.</td>
          </tr>
		  <tr valign="top">
		    <td>
		      <p>&#149;</p>
		      </td>
		    <td>
		      <p>Endast trappor kan automatiskt g&ouml;ra h&aring;l i innertak och i golv p&aring; de &ouml;vre v&aring;ningarna. D&auml;rf&ouml;r f&aring;r du inte gl&ouml;mma v&auml;lja <i>Trappor</i>-kryssrutan om du vill att en importerad m&ouml;bel ska bete sig p&aring; detta vis.</td>
		    </tr>
		  <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Importeringen av en 3D-modell till möbelkatalogen <b>eller</b> till hemmet beror av huruvida katalogen har fokus eller ej när du väljer
              <i>Möbler &gt; Importera möbler...</i>. Om möbellistan, planlösningen eller 3D-vyn har fokus när du väljer detta menyalternativ kommer den importerade modellen endast dyka upp i katalogen om du kryssar i rutan <i>Lägg till i katalog</i>, i tredje steget i möbelimporteraren.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Enheten som visas som standard i möbelimporteraren beror av ditt land. Du kan byta till centimeter, meter,
              millimeter eller tum i <a href="editingPreferences.html">inställnings</a>-rutan. </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Då möbelkatalogen delas mellan alla Sweet Home 3D-fönster kan ingen inverkan på katalogen (d.v.s. importering, modifiering och borttagning) ångras. </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Egenskaperna på importerade katalogmöbler lagras automatiskt i inställningarna och deras 3D-modeller och ikonfiler lagras i mappar specifika för  Sweet Home 3D.</td>
          </tr>
		  <tr valign="top">
			<td><p>&#149;</p></td>
			<td><p>Menyalternativet <i>Möbler &gt; Importera möbelbibliotek...</i> låter dig också importera några bibliotek med förinställda möbler lagrade i SH3F-filer och tillgängliga på <a href="http://www.sweethome3d.com/sv/importModels.html">Sweet Home 3D-webbsidan</a>.</p></td>
		  </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
