<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<meta name="keywords" content="etages, étages">
	<title>Ajout de niveaux</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader"><a class="bread" href="index.html">Aide Sweet Home 3D</a> > <A class="bread" HREF="tocCreating.html">Cr&eacute;ation de
	logements, de	murs et de meubles</A></div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Ajout de niveaux</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Chaque logement est cr&eacute;&eacute; avec un niveau par d&eacute;faut, mais Sweet Home 3D est aussi capable de g&eacute;rer plusieurs niveaux, avec la possibilit&eacute; pour chaque niveau d'&ecirc;tre au dessus ou en dessous du sol. Pour ajouter un nouveau niveau, choisissez le menu <i>Plan &gt; Ajouter un  niveau</i>. Aussit&ocirc;t que le logement comporte plus d'un niveau, des onglets apparaissent au dessus de la vue du plan pour vous permettre de s&eacute;lectionner le niveau auquel vous voulez ajouter des objets. Le dernier onglet contient un signe <font size="+1"><b>+</b></font> sur lequel vous pouvez  cliquer aussi pour cr&eacute;er des niveaux suppl&eacute;mentaires si besoin.
</p>
	  <table border="0" align="center" cellpadding="0" cellspacing="5">
	    <tr align="center">
    <td><img src="../images/addingLevel.png" alt="Ajout de niveaux" width="416" height="234"></td>
    </tr>
  <tr>
    <td align="center" valign="top">Nouveau niveau montrant en couleur claire les murs et les plafonds du niveau inf&eacute;rieur </td>
    </tr>
</table>
      <p>Pour vous aider &agrave; vous retrouver dans le niveau sup&eacute;rieur, les murs et les plafonds du niveau inf&eacute;rieur sont en couleur claire dans la vue du plan. Si le niveau en cours d'&eacute;dition est le plus bas, ce sont alors les murs et les planchers du niveau au dessus qui seront dessin&eacute;s en couleur claire. Quand le magn&eacute;tisme est actif, le curseur de la souris est magn&eacute;tis&eacute; sur ces murs et ces pi&egrave;ces pour vous simplifier l'utilisation des outils de dessin des murs et des pi&egrave;ces. Si besoin, vous pouvez aussi copier des murs, des pi&egrave;ces ou des meubles d'un autre niveau pour les coller dans le nouveau niveau.</p>
      <p>Chaque niveau a une &eacute;l&eacute;vation et d'autres attributs qui peuvent &ecirc;tre <a href="editingLevels.html">modifi&eacute;s</a>. Si le haut des murs et des meubles ajout&eacute;s &agrave; un niveau inf&eacute;rieur est plus &eacute;lev&eacute; que l'&eacute;l&eacute;vation du niveau s&eacute;lectionn&eacute;, ils appara&icirc;tront alors en couleur normale, comme les murs ext&eacute;rieurs, l'escalier en colima&ccedil;on et la fen&ecirc;tre &agrave; droite dans la figure suivante.</p>
      <table border="0" align="center" cellpadding="0" cellspacing="5">
        <tr align="center">
      <td><img src="../images/level1WithHighWalls.png" alt="Ajout de niveaux" width="416" height="234"></td>
    </tr>
    <tr>
      <td align="center" valign="top"><p>Nouveau niveau montrant en couleur normale les murs  et meubles &eacute;lev&eacute;s du niveau inf&eacute;rieur</p></td>
    </tr>
</table>
      <p>L'ajout d'un nouveau niveau n'a aucun effet direct dans la vue 3D, et aucun plancher n'est ajout&eacute; automatiquement pour s&eacute;parer un niveau d'un autre. Ca n'est qu'&agrave; partir du moment o&ugrave; vous commencez &agrave; y dessiner des murs, des pi&egrave;ces et y ajouter du mobilier que vous verrez appara&icirc;tre ces nouveaux objets &agrave; l'&eacute;l&eacute;vation du nouveau niveau.</p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16"><p>&#149;</p></td>
            <td><p>La hauteur et l'&eacute;paisseur de plancher d'un nouveau niveau
              peut &ecirc;tre modifi&eacute;e dans le panneau des <a href="editingPreferences.html">pr&eacute;f&eacute;rences</a>. L'&eacute;l&eacute;vation d'un nouveau niveau est calcul&eacute;e en additionnant l'&eacute;l&eacute;vation du dernier niveau, sa hauteur et l'&eacute;paisseur de plancher choisie dans les pr&eacute;f&eacute;rences.</p></td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td> Une fois qu'un niveau est cr&eacute;&eacute;, vous pouvez <a href="editingLevels.html">modifier</a> son nom, son &eacute;l&eacute;vation et ses hauteurs en double-cliquant sur son onglet, ou en choisissant le menu <i>Plan &gt; Modifier le niveau</i>....</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td> Les onglets au dessus de la vue du plan sont tri&eacute;s dans l'ordre de l'&eacute;l&eacute;vation des niveaux, puis &agrave; &eacute;l&eacute;vation &eacute;gale dans l'ordre inverse de leur hauteur.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td> La s&eacute;lection d'un meuble dans la liste des meubles s&eacute;lectionnera automatiquement le niveau dans lequel le meuble avait &eacute;t&eacute; ajout&eacute;, si ce meuble ne peut &ecirc;tre visualis&eacute; dans le niveau en cours de s&eacute;lection.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Chaque niveau d'un logement peut avoir sa propre  <a href="importingBackground.html">image d'arri&egrave;re plan</a> pour dessiner des murs et des pi&egrave;ces par dessus.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
              </td>
            <td>
              <p>Les murs et les plafonds  d'un autre niveau dessin&eacute; en couleur claire ne sont ni imprim&eacute;s, ni copi&eacute;s dans le presse-papier. Ils sont pr&eacute;sents uniquement pour vous aider &agrave; vous y retrouver et dessiner plus rapidement le niveau sup&eacute;rieur.</p>
              </td>
          </tr>
        </table>
       </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>