<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Dimensionen/Bemaßungen zeichnen</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	
  <div id="helpheader"> <a class="bread" href="index.html">Sweet Home 3D Hilfe</a> 
    > <a class="bread" href="tocCreating.html">Erstellen von Wohnungen, Wänden 
    und Möbeln</a> </div>
</div>
<div id="mainbox" align="left"> 
  <table width="100%" border="0" cellspacing="0" cellpadding="0">
    <tr valign="bottom" height="32"> 
      <td width="3" height="32">&nbsp;</td>
      <td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
      <td width="8" height="32">&nbsp;&nbsp;</td>
      <td valign="bottom" height="32"><font id="topic">Dimensionen/Bemaßungen 
        zeichnen</font></td>
    </tr>
    <tr height="10"> 
      <td colspan="4" height="10">&nbsp;</td>
    </tr>
  </table>
  <table width="100%" border="0" cellspacing="0" cellpadding="3">
    <tr> 
      <td><p>Um eine Dimension/Bemaßung einzuzeichnen, müssten Sie zuerst im Menü 
          <i>Plan &gt; Bemaßung erstellen</i> oder das <i>Zeichnet Bemaßungen 
          ein</i> -Werkzeug auswählen. </p>
        <blockquote> 
          <p><img src="../images/createDimensionsTool.png" alt="Dimension Creation mode tool" width="24" height="24" align="absmiddle">&nbsp; 
            <i>Zeichnet Bemaßungen ein</i> -Werkzeug</p>
        </blockquote>
        <p class="plist">Sie k&ouml;nnen neue Dimensionierungen im Plan auf verschiedene 
          Wege erstellen:</p>
        <ul>
          <li> Klicken Sie auf den Startpunkt einer neuen Dimension, klicken Sie 
            auf den Endpunkt, und klicken Sie ein drittes Mal, nachdem Sie den 
            Mauszeiger bewegt haben, um die L&auml;nge der Erweiterungslinien 
            zu w&auml;hlen, die am Ende jeder Dimensionslinie gezeichnet wird</li>
          <li> Bewegen Sie den Mauszeiger auf ein Ende eines M&ouml;belst&uuml;cks, 
            einer Wand oder eines Raumes, dem Sie eine Bema&szlig;ung/Dimension 
            geben wollen, klicken Sie doppelt, um die tempor&auml;re Bema&szlig;ung 
            zu akzeptieren, dann klicken Sie ein drittes Mal, nachdem Sie die 
            L&auml;nge der Erweiterungslinien ausgew&auml;hlt haben.</li>
        </ul>
        <p class="plist">In beiden F&auml;llen haben die neuen Bema&szlig;ungen 
          keine Erweiterungslinien, wenn Sie die Maus nicht zwischen dem zweiten 
          und dritten Klick bewegt haben.<br>
          Dr&uuml;cken Sie jederzeit die <i>Escape</i>-Taste, um die Erstellung 
          einer Bema&szlig;ung/Dimension abzubrechen.<br>
          W&auml;hrend Sie den Endpunkt einer Dimension w&auml;hlen, wird jede 
          Mausbewegung ein Update des Planes bzw. der angezeigten Gr&ouml;&szlig;e 
          und L&auml;nge der Dimension hervorrufen.</p>
        <table border="0" align="center" cellpadding="0" cellspacing="5">
          <tr> 
            <td><img src="../images/drawingDimensions.png" alt="Drawing dimensions" width="247" height="175"></td>
            <td><img src="../images/drawingExtensionLines.png" alt="Drawing dimensions with extension lines" width="247" height="175"></td>
          </tr>
          <tr align="center"> 
            <td>Erstellen einer Bemaßung <br> <b>ohne</b> Erweiterungslinien</td>
            <td>Erstellen einer Bemaßung <br> <b>mit</b> Erweiterungslinien</td>
          </tr>
        </table>
        <p>Um das Zeichnen von Dimensionen/Bemaßungen zu beenden, wählen Sie <i>Plan 
          &gt; Auswählen </i> oder wählen Sie das <i>Auswahl</i> -Werkzeug an.</p>
        <blockquote> 
          <p><img src="../images/selectTool.png" alt="Select tool" width="24" height="24" align="absmiddle">&nbsp;<i>Auswahl</i> 
            -Werkzeug</p>
        </blockquote></td>
    </tr>
  </table>
  <div id="taskbox"> 
    <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
      <tr valign="top" BGCOLOR="#eeeeee"> 
        <td bgcolor="#eeeeee" width="98%"> <table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Um Ihnen zu helfen, eine Bema&szlig;ung/Dimension pr&auml;zise 
                  einzuzeichnen, benutzen Sie bitte die &quot;Ausrichtungslinien&quot;, 
                  die von der aktuellen Mauszeiger-Position zur n&auml;chsten 
                  Wandecke, Raumende oder M&ouml;belecke angezeigt werden. Wenn 
                  Sie die Enter-Taste dr&uuml;cken, w&auml;hrend der Plan den 
                  Fokus hat, wird ein editierbarer Tooltip angezeigt, mit dem 
                  Sie per Tastatur die L&auml;nge und den Winkel einer Dimension 
                  angeben k&ouml;nnen (Haben Sie noch keine neue Dimension erstellt, 
                  wird der Tooltip die Koordinaten des Startpunktes f&uuml;r eine 
                  neue Dimension anzeigen), danach den Abstand, die L&auml;nger 
                  der Erweiterungslinien etc. Benutzen Sie die Pfeiltasten <i>hoch</i> 
                  und <i>runter</i> bzw. die <i>Tab</i>-Taste, um einen anderen 
                  Wert zu bearbeiten und best&auml;tigen Sie Ihre Werte mit der 
                  <i>Enter</i>-Taste. Wollen Sie die Maus wieder benutzen um eine 
                  weitere Dimension zu zeichnen, bewegen Sie sie einfach wieder 
                  &uuml;ber den Plan.</p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Um Bemaßungen präzise einzuzeichnen, benutzen Sie die Ausrichtungslinien, 
                  die als Hilfe von der Position des Mauszeigers zur nächstgelegenen 
                  Wand oder Möbelstück angezeigt werden.</p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Die Position und Ausrichtung der Längenangabe einer Bemaßungslinie 
                  hängt von der relativen Position der Start- und Endpunkte ab, 
                  und von der Position der Erweiterungslinien.</p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Um parallele Bemaßungen/Dimensionen einzuzeichnen, ist der 
                  Winkel standardmäßig auf ein Vielfaches von 15&deg; eingestellt. 
                  Sie können dies kurzfristig ändern, indem Sie während des Einzeichnens 
                  die Shift-Taste gedrückt halten, oder indem Sie den sogenannten 
                  Magnetismus in den <a href="editingPreferences.html">Einstellungen</a> 
                  deaktivieren.</p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Ist eine Bemaßung einmal erstellt, können Sie jederzeit 
                  deren Position und Größe mit der Maus <a href="editingDimensions.html">ändern</a>. 
                </p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Die Länge, die über der Bemaßung angezeigt wird, ist standardmäßig 
                  auf eine gültige Maßeinheit in Ihrem Land eingestellt. Sie können 
                  jedoch in den <a href="editingPreferences.html">Einstellungen</a> 
                  jederzeit zwischen Zentimeter, Meter, Millimeter und Inch wechseln. 
              </td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Die Höhe der Schriftart, welche benutzt wird um den Text 
                  der Bemaßung anzuzeigen, kann geändert werden, indem Sie die 
                  Skalierung des Plans ändern. Dies können Sie über <i>Plan &gt; 
                  Vergrößern</i> oder <i>Plan &gt; Verkleinern</i> bewerkstelligen.</td>
            </tr>
            <tr valign="top"> 
              <td width="16"><p>&#149;</p></td>
              <td> <p>Während das <i>Bemaßung erstellen</i> -Werkzeug ausgewählt 
                  ist, sind viele andere Werkzeuge und Menüs deaktiviert. Sollten 
                  Sie eines dieser Werkzeuge benötigen, wählen Sie das <i>Auswahl</i> 
                  -Werkzeug wieder an.</p></td>
            </tr>
          </table></td>
      </tr>
    </table>
  </div>
</div>
</body>

</html>