<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Niveaus bearbeiten</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Sweet Home 3D-Hilfe</a> > <a class="bread" href="tocEditing.html">&Auml;ndern der Einstellungen, des Planungs- und des 3D-Modus</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D-Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Niveaus bearbeiten</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Sie k&ouml;nnen den Namen, die Anhebung und die H&ouml;hen eines Niveaus bearbeiten, indem Sie seinen Reiter doppelt anklicken, oder indem Sie im Men&uuml; <i>Plan &gt; Niveau bearbeiten</i> w&auml;hlen.<br>
      Im Einstellungsbereich eines Niveaus k&ouml;nnen dessen Attribute ge&auml;ndert werden. Zudem wird eine Tabelle angezeigt, in der s&auml;mtliche Niveaus der Wohnung aufgef&uuml;hrt sind. Darin entspricht die ausgew&auml;hlte Zeile dem momentan bearbeiteten Niveau.</p>
<p align="center"><img src="images/editingLevels.png" alt="Modify levels"></p>
	    <p>In der 3D-Ansicht wird die Dicke des Bodens zum Zeichnen des vertikalen Rands um einen Boden verwendet. Diese Fl&auml;chen sind am Rand von L&ouml;chern im Boden und am Rand eines Zwischenstocks oder Balkons sichtbar.<br>
          Die Anhebung eines Niveaus kann positiv oder negativ sein. In letzterem Fall wird der Boden in der 3D-Ansicht stets automatisch weiter ausgeh&ouml;hlt, wann immer ein M&ouml;belst&uuml;ck, ein Raum oder ein abgeschlossener Bereich aus W&auml;nden im Untergrundniveau eingef&uuml;gt wird. Diese Feature kann dazu verwendet werden, einen Swimming Pool zu erzeugen oder einen Keller mit einem oder mehreren Stockwerken zu erstellen.</p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td>Es ist nicht notwendig, die Werte so anzugeben, dass die Niveaus exakt aufeinanderliegen.
              Sie k&ouml;nnen das Niveau-Feature auch dazu verwenden, Zwischenb&ouml;den, angehobene B&ouml;den und Zwischendecken zu erzeugen. Ebenso k&ouml;nnen Sie Niveaus mit derselben Anhebung als Layer verwenden, um einzelne Elemente wie <a href="drawingDimensions.html">Bema&szlig;ungen</a> oder <a href="addingTexts.html">Texte</a> zu isolieren.</td>
          </tr>
            <tr valign="top"> 
              <td width="16"> <p>&#149;</p></td>
              <td> <p>Die Reiter am oberen Rand der Planungsansicht zeigen die Namen der Niveaus in Reihenfolge ihrer Anhebung an. Haben mehrere Niveaus dieselbe Anhebung, so werden diese von hoch nach niedrig ihrer H&ouml;he nach sortiert. Wird die Anhebung und/oder die H&ouml;he eines Niveaus ge&auml;ndert, wird die Reihenfolge der Reiter automatisch angepasst.</td>
            </tr>
          </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>