<html>
	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Aide Sweet Home 3D</title>
		<link href="../help.css" rel="stylesheet" media="all">
	</head>

	<body bgcolor="#ffffff">
		<div id="banner">
			<div id="helpheader">
				<a class="bread" href="index.html">Aide Sweet Home 3D</a>
			</div>
		</div>
	    <div id="mainbox" align="left">
          <table width="100%" border="0" cellspacing="0" cellpadding="0">
            <tr valign="bottom" height="32">
              <td width="3" height="32">&nbsp;</td>
              <td width="32" height="32"><img src="../images/sweethome3dIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
              <td width="8" height="32">&nbsp;&nbsp;</td>
              <td valign="bottom" height="32"><font id="topic">Interface Utilisateur de Sweet Home 3D</font></td>
            </tr>
            <tr height="10">
              <td colspan="4" height="10">&nbsp;</td>
            </tr>
          </table>
          <table width="100%" border="0" cellspacing="0" cellpadding="3">
            <tr>
              <td><p>Chaque fen&ecirc;tre Sweet Home
                    3D
permet d'&eacute;diter l'am&eacute;nagement int&eacute;rieur d'un logement et est divis&eacute;e en quatre panneaux redimensionnables,
d&eacute;crits comme suit.</p>
                <p align="center"><img src="../images/sweethome3dZones.png" alt="User Interface parts" width="400" height="337"></p></td>
            </tr>
          </table>
          <div id="taskbox">
            <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
              <tr valign="top" BGCOLOR="#eeeeee">
                <td bgcolor="#eeeeee" width="98%">
                  <table border="0" cellspacing="0" cellpadding="4">
                    <tr valign="top">
                      <td nowrap><p>1.</p>
                      </td>
                      <td><p>Le catalogue des meubles.<br>
                            Ce catalogue est organis&eacute; par cat&eacute;gories et contient tous les meubles et les objets
                            que vous pouvez ajouter &agrave; l'am&eacute;nagement de votre logement.
                            Vous pouvez afficher les meubles d'une cat&eacute;gorie en cliquant sur le triangle affich&eacute; &agrave; c&ocirc;t&eacute; de
                                son nom ou en double-cliquant sur la cat&eacute;gorie elle-m&ecirc;me.</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>2.</p>
                      </td>
                      <td><p>La liste des meubles du logement.<br>
                            Cette liste contient tous les meubles de votre logement y compris les portes et les fen&ecirc;tres.
                                Le nom, les dimensions, la couleur et d'autres caract&eacute;ristiques de chaque meuble y sont affich&eacute;s.
                                Cette liste peut &ecirc;tre tri&eacute;e en cliquant sur le titre de chacune des colonnes.</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>3.</p>
                      </td>
                      <td><p>Le plan du logement.<br>
                            Ce panneau affiche votre logement vue de haut. C'est &agrave; cet endroit que vous dessinez les murs
                                de votre logement et que vous placez vos meubles, &agrave; l'aide de la souris ou des fl&egrave;ches du
                                clavier.</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>4.</p>
                      </td>
                      <td><p>La vue 3D du logement.<br>
                            Ce panneau affiche votre logement en 3 dimensions. Vous pouvez y voir votre logement soit du
                                dessus, soit du point de vue d'un visiteur virtuel.<br>
                      </p>
                      </td>
                    </tr>
                  </table>
                </td>
              </tr>
            </table>
          </div>
		  <table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Chacun de ces panneaux peut avoir le focus, et certaines des op&eacute;rations propos&eacute;es par les menus de
	    Sweet Home 3D d&eacute;pendent du panneau qui a le focus, reconnaissable au rectangle color&eacute; qui l'entoure.
	    Pour transf&eacute;rer le focus &agrave; un autre panneau, utilisez les touches tabulation et majuscule + tabulation,
	    ou cliquez dans le panneau auquel vous voulez donner le focus.</p>
	  <p>La barre d'outils en haut de ces quatre panneaux peut &ecirc;tre plac&eacute;e en dehors de la fen&ecirc;tre ou plac&eacute;e
	    sur l'un des trois autres bords de la fen&ecirc;tre en la glissant-d&eacute;posant avec la souris.</p></td>
	</tr>
</table>
    </div>
	</body>

</html>